# Цыремпилов Андрей НКАбд-06-25

# 30.Определить структуру с именем Printer содержащую следующие поля:
# страна производитель; скорость печати (в мин); качество печати; цена. +написать функцию сортировки одного из полей структуры.

# Создаем класс Printer, который будет представлять структуру данных для хранения информации о принтере
class Printer:
    # Конструктор класса, инициализирует объект с переданными параметрами
    def __init__(self, country, speed, quality, price):
        self.country = country  # Сохраняем страну-производитель
        self.speed = speed      # Сохраняем скорость печати (стр/мин)
        self.quality = quality  # Сохраняем качество печати
        self.price = price      # Сохраняем цену принтера

    # Метод для строкового представления объекта, вызывается при печати
    def __str__(self):
        return f"Страна: {self.country}, Скорость: {self.speed} стр/мин, Качество: {self.quality}, Цена: {self.price} руб."


# Функция для ввода целого числа с проверкой корректности
def input_int(prompt):
    while True:  # Бесконечный цикл, пока не получим корректный ввод
        try:
            value = int(input(prompt))  # Пытаемся преобразовать ввод в целое число
            if value >= 0:  # Проверяем, что число неотрицательное
                return value  # Возвращаем корректное значение
            else:
                print("Ошибка: введите целое неотрицательное число!")  # Сообщение об ошибке
        except ValueError:  # Обрабатываем ошибку, если ввод не является числом
            print("Ошибка: введите целое число!")  # Сообщение об ошибке


# Функция для ввода дробного числа с проверкой корректности
def input_float(prompt):
    while True:  # Бесконечный цикл, пока не получим корректный ввод
        try:
            value = float(input(prompt))  # Пытаемся преобразовать ввод в дробное число
            if value >= 0:  # Проверяем, что число неотрицательное
                return value  # Возвращаем корректное значение
            else:
                print("Ошибка: введите неотрицательное число!")  # Сообщение об ошибке
        except ValueError:  # Обрабатываем ошибку, если ввод не является числом
            print("Ошибка: введите число!")  # Сообщение об ошибке


# Функция для ввода строки с проверкой на пустоту
def input_string(prompt):
    while True:  # Бесконечный цикл, пока не получим корректный ввод
        value = input(prompt).strip()  # Получаем ввод и удаляем пробелы по краям
        if value:  # Проверяем, что строка не пустая
            return value  # Возвращаем корректное значение
        print("Ошибка: строка не может быть пустой!")  # Сообщение об ошибке


# Функция для ввода данных о принтере
def input_printer():
    print("\nВведите данные о принтере:")  # Заголовок для ввода данных
    country = input_string("Страна производитель: ")  # Ввод страны производителя
    speed = input_int("Скорость печати (стр/мин): ")  # Ввод скорости печати
    quality = input_string("Качество печати: ")  # Ввод качества печати
    price = input_float("Цена (руб.): ")  # Ввод цены принтера
    return Printer(country, speed, quality, price)  # Создаем и возвращаем объект Printer


# Функция сортировки принтеров по цене (по возрастанию)
def sort_by_price(printers):
    return sorted(printers, key=lambda x: x.price)  # Сортируем по полю price


# Функция сортировки принтеров по скорости (по убыванию)
def sort_by_speed(printers):
    return sorted(printers, key=lambda x: x.speed, reverse=True)  # Сортируем по полю speed в обратном порядке


# Функция сортировки принтеров по стране (по алфавиту)
def sort_by_country(printers):
    return sorted(printers, key=lambda x: x.country)  # Сортируем по полю country


# Функция для вывода списка принтеров
def print_printers(printers, title="Список принтеров"):
    print(f"\n=== {title} ===")  # Выводим заголовок
    for i, printer in enumerate(printers, 1):  # Перебираем принтеры с нумерацией с 1
        print(f"{i}. {printer}") # Выводим номер и информацию о принтере


# Основная функция программы
def main():
    print("=== ПРОГРАММА ДЛЯ РАБОТЫ С ДАННЫМИ О ПРИНТЕРАХ ===")  # Заголовок программы
    print("Структура: страна, скорость, качество, цена")  # Описание структуры данных
    print("=================================================")  # Разделительная линия

    printers = []  # Создаем пустой список для хранения принтеров
    n = input_int("\nВведите количество принтеров: ")  # Запрашиваем количество принтеров

    if n == 0:  # Проверяем, если количество равно 0
        print("Количество принтеров равно 0. Программа завершена.")  # Сообщение о завершении
        return  # Завершаем выполнение функции

    for i in range(n):  # Цикл для ввода данных о каждом принтере
        print(f"\n--- Принтер {i + 1} ---")  # Заголовок для текущего принтера
        printers.append(input_printer())  # Добавляем новый принтер в список

    print_printers(printers, "Исходный список принтеров")  # Выводим исходный список

    print("\n=== ВЫБОР СОРТИРОВКИ ===")  # Заголовок меню сортировки
    print("1 - Сортировка по цене (по возрастанию)")  # Опция сортировки по цене
    print("2 - Сортировка по скорости (по убыванию)")  # Опция сортировки по скорости
    print("3 - Сортировка по стране (по алфавиту)")  # Опция сортировки по стране

    choice = input_int("Выберите тип сортировки (1-3): ")  # Запрашиваем выбор пользователя

    # Обрабатываем выбор пользователя
    if choice == 1:
        printers = sort_by_price(printers)  # Сортируем по цене
        print("\n=== Список принтеров отсортирован по цене (по возрастанию) ===")  # Сообщение
    elif choice == 2:
        printers = sort_by_speed(printers)  # Сортируем по скорости
        print("\n=== Список принтеров отсортирован по скорости (по убыванию) ===")  # Сообщение
    elif choice == 3:
        printers = sort_by_country(printers)  # Сортируем по стране
        print("\n=== Список принтеров отсортирован по стране (по алфавиту) ===")  # Сообщение
    else:
        print("\n=== Неверный выбор, вывод без сортировки ===")  # Сообщение об ошибке

    print_printers(printers)  # Выводим итоговый список принтеров


# Проверяем, запущен ли скрипт напрямую (а не импортирован как модуль)
if __name__ == "__main__":
    main()  # Запускаем основную функцию программы
