def result(n: int): # создание функции с параметром натурального числа 
 if not 100 <= n <= 999: # проверка. Если число не трёхзначное 
 n=int(input("ТРЁХзначное число неуч!!!: ")) #выдаёт ошибку 
 a = n // 100 # Первая цифра 
 b = (n // 10) % 10 # Вторая цифра 
 c = n % 10 # Третья цифра 
 res1 = c * 100 + b * 10 + a # " Складываем числа параллельно меняем цифры местами 
 res2 = res1 * 10 # Умножаем на 10, чтобы сделать четырехзначным 
 x = res2 // 1000 # Первая цифра четырехзначного числа 
 y = (res2 // 100) % 10 # Вторая цифра 
 z = (res2 // 10) % 10 # Третья цифра 
 w = res2 % 10 # Четвертая цифра 
 # Меняем местами вторую и третью цифры в четырехзначном числе 
 res3 = x * 1000 + z * 100 + y * 10 + w 
 return res3 # Возвращаем результат 
n = int(input("Введите трёхзначное число: ")) # запрос числа у пользователя 
print(result(n)) # вызов функции и вывод результата
